---
type: SchemaCommon
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 8
tags: [revit-api, class]
---

# SchemaCommon

`Autodesk.Revit.DB.Visual.SchemaCommon` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | BaseSchema | 2018.1 | `public static string BaseSchema { get ; }` |
| Property | Category | 2018.1 | `public static string Category { get ; }` |
| Property | Description | 2018.1 | `public static string Description { get ; }` |
| Property | Hidden | 2018.1 | `public static string Hidden { get ; }` |
| Property | Keyword | 2018.1 | `public static string Keyword { get ; }` |
| Property | Thumbnail | 2018.1 | `public static string Thumbnail { get ; }` |
| Property | UIName | 2018.1 | `public static string UIName { get ; }` |
| Property | VersionGUID | 2018.1 | `public static string VersionGUID { get ; }` |